{
    "bacterial_leaf_blight": {
      "cause": "Penyakit ini terjadi dikarenakan adanya  bakteri *Xanthomonas oryzae* yang menyebar melalui air, hujan, atau irigasi.",
      "solution": "1. Gunakan obat yang tahan terhadap penyakit *Xanthomonas oryzae*, seperti  Kuproxat 2. Semprotkan fungisida berbasis tembaga seperti *Copper Oxychloride* atau *Copper Hydroxide* untuk mengurangi penyebaran bakteri. ",
      "prevention": "1. Jaga kebersihan saluran irigasi agar tidak tercemar oleh air yang membawa bakteri. 2. Jangan tanam padi terlalu rapat untuk memastikan sirkulasi udara yang baik."
    },
    "bacterial_leaf_streak": {
      "cause": "Disebabkan oleh bakteri *Xanthomonas oryzae pv. oryzicola* yang menyerang daun.",
      "solution": "1. Aplikasikan fungisida berbasis tembaga atau antibiotik tanaman seperti *Streptomisin*. 2. Gunakan bateri tambahan (biofungisida) seperti *Pseudomonas fluorescens* untuk menekan pertumbuhan bakteri.",
      "prevention": "1. Jangan menanam tanaman di lahan yang sudah terkontaminasi tanpa sterilisasi terlebih dahulu. 2. Pastikan lingkungan pertanian bersih dari gulma atau tanaman lain yang dapat menjadi inang bakteri."
    },
    "bacterial_panicle_blight": {
      "cause": "Disebabkan oleh bakteri *Burkholderia glumae* yang menyerang malai padi.",
      "solution": "1. Gunakan bakterisida Aktinomiset untuk menekan penyakit.  2. Menggabungkan fungisida yang mengandung tembaga seperti *Copper Oxychloride* dan *Mancozeb* untuk pengendalian. ",
      "prevention": "1. Kurangi pemupukan nitrogen berlebihan karena dapat meningkatkan kerusakan tanaman. 2. Pastikan sistem drainase berfungsi dengan baik untuk mencegah kelembaban berlebih."
    },
    "blast": {
      "cause": "Disebabkan oleh jamur *Magnaporthe oryzae* yang berkembang di kondisi lembap.",
      "solution": "1. Gunakan fungisida berbasis triazol atau strobilurin seperti *Propikonazol* dan *Azoksistrobin*.  2. Potong dan bakar bagian tanaman yang terinfeksi untuk mencegah penyebaran spora jamur.",
      "prevention": "1. Gunakan varietas padi yang tahan terhadap *Magnaporthe oryzae*.  2. Atur pola irigasi dengan benar agar tidak menciptakan kelembapan tinggi yang memicu pertumbuhan jamur."
    },
    "brown_spot": {
      "cause": "Disebabkan oleh jamur *Bipolaris oryzae*, seringkali akibat kekurangan nutrisi atau kondisi stres.",
      "solution": "1. Semprotkan fungisida berbasis mankozeb atau karbendazim seperti *COZENE 70/10 WP*.  2. Berikan pupuk kaya kalium dan fosfor untuk meningkatkan ketahanan tanaman.",
      "prevention": "1. Selalu memberikan air dan nutrisi pada tanaman agar tidak mengalami stress pada tanaman. 2. Lakukan sanitasi lahan untuk menghilangkan sisa-sisa tanaman terinfeksi."
    },
    "dead_heart": {
      "cause": "Disebabkan oleh serangan larva ngengat seperti *Scirpophaga incertulas* yang merusak batang padi.",
      "solution": "1. Gunakan insektisida berbasis abamektin, klorantraniliprol, atau inteksida berbasis biologi seperti *Bacillus thuringiensis* untuk membunuh larva. 2. Potong baguian tanaman yang terserang larva untuk mencegah penyebaran hama.",
      "prevention": "1. Memilih varietas tahan hama seperti varietas *IR64*. 2. Lakukan sanitasi lahan dengan membersihkan sisa-sisa tanaman setelah panen untuk mencegah adanya hama."
    },
    "downy_mildew": {
      "cause": "Disebabkan oleh jamur *Peronosclerospora spp.* yang menyebar melalui spora di udara.",
      "solution": "1. Aplikasikan fungisida sistemik seperti *Metalaksil* pada tanaman yang terinfeksi. 2. Cabut tanaman yang sudah terinfeksi berat untuk mencegah penyebaran spora jamur terhadap tanaman lainnya",
      "prevention": "1. Lakukan rotasi tanaman dan hindari monokultur untuk memutus siklus jamur. 2.Pastikan lahan memiliki drainase yang baik untuk menghindari kelembapan tinggi."
    },
    "hispa": {
      "cause": "Disebabkan oleh serangan kumbang hispa *Dicladispa armigera* yang memakan daun padi.",
      "solution": "1. Semprotkan insektisida seperti *Karbaril*, *Imidakloprid*, atau *Neem oil* pada tahap awal serangan untuk mengendalikan populasi kumbang. 2. Jika ada ujung daun terdapat noda, maka tanaman tersebut harus dicabut.",
      "prevention": "1. Hindari penggunaan puppuk berlebih pada tanaman. 2. Gunakan perangkap cahaya ataupun jaring untuk mencegah kumbang menghinggap di tanaman."
    },
    "normal": {
      "cause": "Tanaman dalam kondisi sehat tanpa tanda penyakit atau hama.",
      "solution": "1. Lakukan pemeliharaan rutin untuk memastikan tanaman tetap sehat.",
      "prevention": "1. Pantau tanaman secara berkala untuk mendeteksi tanda-tanda awal penyakit atau hama. 2. Selalu berikan pengelolaan nutrisi secara optimal."
    },
    "tungro": {
      "cause": "Disebabkan oleh infeksi virus tungro yang ditularkan oleh wereng hijau (*Nephotettix virescens*).",
      "solution": "1. Gunakan insektisida untuk mengendalikan wereng hijau seperti *Buprofezin*. 2. Segera cabut tanaman yang terinfeksi untuk mencegah penyebaran terhadap tanaman lain.",
      "prevention": "1. Menanam tanaman varietas tahan rungro seperti *IR64* atau *Ciherang*. 2. Lakukan tanam serempak untuk memutus siklus wereng hijau."
    }
  }
  